applications/test/singlePhaseDBS/calcite_crystal/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          75;
        startFace       11100;
    }
    outlet
    {
        type            patch;
        nFaces          75;
        startFace       11175;
    }
    fixedwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          150;
        startFace       11250;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          11250;
        startFace       11400;
    }
)

// ************************************************************************* //
