applications/test/singlePhaseDBS/calcite_crystal/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Df              Df [0 2 -1 0 0 0 0] 1e-9;

rhof            rhof [1 -3 0 0 0 0 0] 1000;
rhos            rhos [1 -3 0 0 0 0 0] 2165;

Ceq             Ceq [0 0 0 0 0 0 0] 0.0;

r_si            r_si [0 1 -1 0 0 0 0] 0.01;
gama_si         gama_si [0 0 0 0 0 0 0] 1.0;


transportModel Newtonian;

nu              nu [0 2 -1 0 0 0 0] 1.0e-06;

// ************************************************************************* //
