applications/test/singlePhaseDBS/calcite_crystal/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.1;
lx 0.0002;
ly 0.0002;
Nx 75;
Ny 75;
vertices        
(
    (0 0 0)
    ($lx 0 0)
    ($lx $ly 0)
    (0 $ly 0)
    (0 0 0.0001)
    ($lx 0 0.0001)
    ($lx $ly 0.0001)
    (0 $ly 0.0001)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($Nx $Ny 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    fixedwall
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 4 5 1)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (4 7 6 5)
            (0 3 2 1)
        );
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
