applications/test/singlePhaseDBS/calcite_crystal/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }
    pFinal
    {
        $p;
        relTol          0;
    }

    eps_si
    {
        solver          PBiCGStab;
        preconditioner  none; 
        tolerance       1e-06;
        relTol          0.1;
        // smoother        GaussSeidel;
    }

    C
    {
        solver          PBiCGStab;
        preconditioner  none;    //DILU;
        tolerance       1e-06;
        relTol          0;
        // smoother nnn;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }
    UFinal
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
}


// ************************************************************************* //
